/* automatically generated by rust-bindgen 0.66.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nn_context {
    _unused: [u8; 0],
}
#[doc = " @struct NNContext\n\n DeepViewRT Context.  Refer to the DeepviewRT User Manual for details."]
pub type NNContext = nn_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nn_tensor {
    _unused: [u8; 0],
}
#[doc = " @struct NNTensor\n\n DeepViewRT Tensor objects.  Refer to the DeepViewRT User Manual for details."]
pub type NNTensor = nn_tensor;
#[doc = " @struct NNModel\n\n DeepviewRT Model (RTM).  Refer to the DeepViewRT User Manual for details."]
pub type NNModel = ::std::os::raw::c_void;
#[doc = " Successfull operation, no error."]
pub const VAALError_VAAL_SUCCESS: VAALError = 0;
#[doc = " Internal error without a specific error code, catch-all error."]
pub const VAALError_VAAL_ERROR_INTERNAL: VAALError = 1;
#[doc = " The provided handle is invalid.  This error is typically used by NNEngine\n when interfacing with another API"]
pub const VAALError_VAAL_ERROR_INVALID_HANDLE: VAALError = 2;
#[doc = " Out of memory error, returned if a call to malloc returns NULL or similar\n error."]
pub const VAALError_VAAL_ERROR_OUT_OF_MEMORY: VAALError = 3;
#[doc = " Out of resources errors are similar to out of memory though sometimes\n treated separately by underlying plugins."]
pub const VAALError_VAAL_ERROR_OUT_OF_RESOURCES: VAALError = 4;
#[doc = " Signals an API has not been implemented.."]

#[doc = " The VAAL_PTR is a standard void* pointer."]
pub const VAALType_VAAL_PTR: VAALType = 1;
#[doc = " The VAAL_FUNC is a function pointer."]
pub const VAALType_VAAL_FUNC: VAALType = 2;
#[doc = " The VAAL_STR type is a standard NULL-terminated C-string."]
pub const VAALType_VAAL_STR: VAALType = 3;
#[doc = " The VAAL_I8 type maps to a C int8_t"]
pub const VAALType_VAAL_I8: VAALType = 4;
#[doc = " The VAAL_U8 type maps to a C uint8_t"]
pub const VAALType_VAAL_U8: VAALType = 5;
#[doc = " The VAAL_I16 type maps to a C int16_t"]
pub const VAALType_VAAL_I16: VAALType = 6;
#[doc = " The VAAL_U16 type maps to a C uint16_t"]
pub const VAALType_VAAL_U16: VAALType = 7;
#[doc = " The VAAL_I32 type maps to a C int32_t"]
pub const VAALType_VAAL_I32: VAALType = 8;
#[doc = " The VAAL_U32 type maps to a C uint32_t"]
pub const VAALType_VAAL_U32: VAALType = 9;
#[doc = " The VAAL_I64 type maps to a C int64_t"]
pub const VAALType_VAAL_I64: VAALType = 10;
#[doc = " The VAAL_U64 type maps to a C uint64_t"]
pub const VAALType_VAAL_U64: VAALType = 11;
#[doc = " The VAAL_F16 type is currently unsupported but would map to either an ARM\n __fp16 or C11 (GCC extension) _Float16 type."]
pub const VAALType_VAAL_F16: VAALType = 12;
#[doc = " The VAAL_F32 type maps to a C float"]
pub const VAALType_VAAL_F32: VAALType = 13;
#[doc = " The VAAL_F64 type maps to a C double"]
pub const VAALType_VAAL_F64: VAALType = 14;
#[doc = " VAAL datatype definitions are used for identifying type information of the\n context parameters."]
pub type VAALType = ::std::os::raw::c_uint;
#[doc = " Common bounding box structure used by all decoders.  The box is defined by\n the minimum and maximum coordinates of the x,y points as normalized values.\n Normalized values are in the range 0..1 and can be multiplied by the size of\n an image to de-normalize back to actual pixel locations.\n\n The label is an index which can be used to access the textual label from the\n model or a labels file.\n\n The score's definition is model-specific but generally it is a sigmoid\n processed value."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VAALBox {
    #[doc = " left-most normalized coordinate of the bounding box."]
    pub xmin: f32,
    #[doc = " top-most normalized coordinate of the bounding box."]
    pub ymin: f32,
    #[doc = " right-most normalized coordinate of the bounding box."]
    pub xmax: f32,
    #[doc = " bottom-most normalized coordinate of the bounding box."]
    pub ymax: f32,
    #[doc = " model-specific score for this detection, higher implies more confidence."]
    pub score: f32,
    #[doc = " label index for this detection, text representation can be retrived using\n @ref VAALContext::vaal_label()"]
    pub label: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_VAALBox() {
    const UNINIT: ::std::mem::MaybeUninit<VAALBox> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VAALBox>(),
        24usize,
        concat!("Size of: ", stringify!(VAALBox))
    );
    assert_eq!(
        ::std::mem::align_of::<VAALBox>(),
        4usize,
        concat!("Alignment of ", stringify!(VAALBox))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(xmin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymin) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(ymin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmax) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(xmax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymax) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(ymax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).score) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(score)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(VAALBox),
            "::",
            stringify!(label)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vaal_context {
    _unused: [u8; 0],
}
